Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: I need to do something.
kw: Res yw dhymm gul neppyth.

source: I need to do that.
kw: Res yw dhymm gul henna.

source: I need to feed my dog.
kw: Res yw dhymm maga ow hi.

source: I need to go back.
kw: Res yw dhymm mos arta.

source: I need to know more.
kw: Res yw dhymm godhvos moy.

source: I need to know now.
kw: Res yw dhymm godhvos lemmyn.

source: I need to know something.
kw: Res yw dhymm godhvos neppyth.

source: I need to leave.
kw: Res yw dhymm diberth.

source: I need to see you tonight.
kw: Res yw dhymm dha weles haneth.

source: I need to sleep.
kw: Res yw dhymm koska.

source: I need to try.
kw: Res yw dhymm assaya.

source: I need to understand.
kw: Res yw dhymm konvedhes.

source: I needed to eat.
kw: Res o dhymm dybri.

source: I put it in your room.
kw: My a’n gorras y’th roum.

source: Do you want to buy a shirt?
kw: A vynn’ta prena krys?

source: I don't like to clean.
kw: Nyns yw da genev glanhe.

source: I still need to talk to you.
kw: Res yw dhymm hwath kewsel orthis.

source: I think Tom was drunk.
kw: Medhow o Tom, dell grysav.

source: I want to see your house.
kw: My a vynn gweles dha ji.

source: I was watching.
kw: Yth esen vy ow mires orth.

source: The woman cried when she heard the bad news.
kw: An venyn a olas pan glewas an yeyn-nowodhow.

source: I had a cat.
kw: Yth esa kath dhymm.

source: We didn't need to do that.
kw: Nyns o res dhyn gul henna.

source: Why do I need to learn French?
kw: Prag yth yw res dhymm dyski Frynkek?

source: I have two cats.
kw: Yma diw gath dhybm.

source: What color is Tom's dog?
kw: Py liw yw ki Tom?

source: I want ice cream.
kw: My a vynn kavos dehen rew.

source: Is this Tom?
kw: Yw hemma Tom?

source: Laurie hates school.
kw: Kas yw gans Laurie skol.

source: The dog went under the table.
kw: an ki eth yn-dann an voos.

source: Excuse me!
kw: Askus vy!

source: Speak slowly!
kw: Kows yn lent!

source: The man was eating bread.
kw: Yth esa an den ow tybri bara.

source: That apple is big.
kw: Bras yw an aval na.

source: Tom hates school.
kw: Kas yw gans Tom skol.

source: I have to see this.
kw: Res yw dhymm gweles hemma.

source: She's looking at us.
kw: Yma hi ow mires orthyn.

source: I think Tom speaks French well.
kw: My a breder y kews Tom Frynkek yn ta.

source: I'm trying to learn French.
kw: Yth esov vy owth assaya dyski Frynkek.

source: I need to learn French.
kw: Res yw dhymm dyski Frynkek.

source: I like to study French.
kw: Da yw genev studhya Frynkek.

source: I have to study French.
kw: Res yw dhymm studhya Frynkek.

source: I have to learn French.
kw: Res yw dhymm dyski Frynkek.

source: I must learn French.
kw: Res yw dhymm dyski Frynkek.

source: I like French.
kw: Da yw genev Frynkek.

source: I hate French.
kw: Kas yw genev Frynkek.

source: I have to find that.
kw: Res yw dhymm kavos henna.

source: I must do something.
kw: Res yw dhymm gul neppyth.

source: They need to study.
kw: Res yw dhedha studhya.

source: They need to work tomorrow.
kw: Res yw dhedha oberi a-vorow.

source: He ate fruit and vegetables.
kw: Ev a dhybris frutys ha losow-kegin.

source: Pirates are cruel.
kw: Garow yw morladron.

source: Where is Laurie?
kw: Ple’ma Laurie?

source: Where is the hotel?
kw: Ple’ma’n ostel?

source: He is afraid.
kw: Yma own dhodho.

source: It is not a dog.
kw: Nyns yw ki.

source: Where is the dog?
kw: Ple'ma an ki?

source: Give me a little ice cream.
kw: Ro dhymm nebes dehen rew.

source: That's his horse.
kw: Henn yw y vargh.

source: You have to try!
kw: Res yw dhis assaya!

source: I hate the winter.
kw: Kas yw genev an gwav.

source: I hate winter.
kw: Kas yw genev gwav.

source: She doesn't like this game.
kw: Nyns yw da gensi an gwari ma.

source: I ate the red apples.
kw: My a dhybris an avalow rudh.

source: Those are my friends.
kw: An re na yw ow howetha.

source: You have to eat something.
kw: Res yw dhis dybri neppyth.

source: What's your father's name?
kw: Pyth yw hanow dha das?

source: Tom's not in the hospital.
kw: Nyns usi Tom y’n klavji.

source: You need to listen to us.
kw: Res yw dhis goslowes orthyn.

source: You have to listen to me.
kw: Res yw dhis goslowes orthiv.

source: Take the dog for a walk.
kw: Kemmer an ki rag kerdh.

source: I'm trying to read here.
kw: Yth esov vy owth assaya redya omma.

source: What's your dog's name?
kw: Pyth yw hanow dha gi?

source: I'm trying to practice.
kw: Yth esov vy owth assaya praktisya.

source: I'm trying to help now.
kw: Yth esov vy owth assaya gweres lemmyn.

source: I used to believe that.
kw: My a wre krysi henna.

source: Tom didn't have a dog.
kw: Nyns esa ki dhe Tom.

source: I'm Tom's grandmother.
kw: Mamm wynn Tomm ov.

source: I was looking for you.
kw: Yth esen vy ow mires ragos.

source: You're a teacher now.
kw: Dyskador os ta lemmyn.

source: You'll have to leave.
kw: Res vydh dhis diberth.

source: They'll have to wait.
kw: Res vydh dhedha gortos.

source: Is that your bicycle?
kw: Yw henna agas diwdros?

source: I was trying to help.
kw: Yth esen vy owth assaya gweres.

source: I used to live there.
kw: My a wre triga ena.

source: We'll have to hurry.
kw: Res vydh dhyn fistena.

source: I'll give it to Tom.
kw: My a vynn y ri dhe Tom.

source: I used to love Mary.
kw: My a gara Maria.

source: I used to come here.
kw: My a wre dos omma.

source: Are those new shoes?
kw: Yw an re na eskisyow nowydh?

source: You have to listen.
kw: Res yw dhis goslowes.

source: You are my friends.
kw: Ow howethesow owgh hwi.

source: We'll have to wait.
kw: Res vydh dhyn gortos.

source: I'm trying to help.
kw: Yth esov vy owth assaya gweres.

source: You'll have to go.
kw: Res vydh dhis mos.

source: Tom, are you here?
kw: Tom, es’ta omma?

source: I'll come at once.
kw: My a vynn dos a-dhesempis.

source: You have to stop.
kw: Res yw dhis hedhi.

source: We have to start.
kw: Res yw dhyn dalleth.

source: The sky was gray.
kw: Loos o an ebron.

source: Is that your dog?
kw: Yw henna dha gi?

source: You're my enemy.
kw: Ow eskar os.

source: You lied to Tom.
kw: Ty a leveris gow dhe Tom.

source: You have to eat.
kw: Res yw dhis dybri.

source: Where's the dog?
kw: Ple'ma an ki?

source: We have to stop.
kw: Res yw dhyn hedhi.

source: We have to help.
kw: Res yw dhyn gweres.

source: Tom lit a match.
kw: Tom a enowis tanbren.

source: I was at school.
kw: Yth esen vy y’n skol.

source: You can't walk.
kw: Ny yll'ta kerdhes.

source: We have to win.
kw: Res yw dhyn gwaynya.

source: We have to eat.
kw: Res yw dhyn dybri.

source: I hate my brother.
kw: Kas yw genev ow broder.

source: I hate my sister.
kw: Kas yw genev ow hwor.

source: You've lost your umbrella.
kw: Ty re gollas dha lawlen.

source: It is raining cats and dogs.
kw: Yma hi ow kul glaw kathes ha keun.

source: Did you like this video?
kw: O da genes an gwydhyow ma?

source: I was running.
kw: Yth esen vy ow ponya.

source: I am trying.
kw: Yth esov vy owth assaya.

source: He's a werewolf.
kw: Gourvleydh yw ev.

source: Goodbye.
kw: Duw genes.

source: It is not easy to write with chalk.
kw: Nyns yw es skrifa gans krey.

source: He wants to dance.
kw: Ev a vynn donsya.

source: Why do you want to learn English?
kw: Prag y fynn'ta dyski Sowsnek?

source: I can't go out.
kw: Ny allav vy mos yn-mes.

source: She is writing a new book this year.
kw: Yma ow skrifa lyver nowydh hevleni.

source: The woman is eating bread.
kw: Yma’n venyn ow tybri bara.

source: The girl is eating bread.
kw: Yma’n vowes ow tybri bara.

source: Tom has died.
kw: Tom re verwis.

source: Emily wants to learn Greek.
kw: Emily a vynn dyski Greka.

source: I see a boy.
kw: My a wel maw.

source: It was windy yesterday.
kw: Gwynsek o de.

source: I went to London.
kw: My eth dhe Loundres.

source: I ate the meat.
kw: My a dhybris an kig.

source: I don't have two cats.
kw: Nyns eus dhymm diw gath.

source: Tom is cleaning his room.
kw: Yma Tom ow klanhe y stevel.

source: Read this book!
kw: Gwra redya an lyver ma!

source: I was in school.
kw: Yth esen vy yn skol.

source: I have a credit card.
kw: Yma dhymm karten gresys.

source: You are not my brother.
kw: Nyns os ta ow broder.

source: They had seven children.
kw: Yth esa seyth flogh dhedha.

source: I'm in Dubai.
kw: Yth esov vy yn Dubai.

source: I drank the water.
kw: My a wrug eva an dowr.

source: I have a heart.
kw: Yma dhymm kolon.

source: My sister has a dog.
kw: Yma ki dhe ow hwor.

source: Tom wants his father to buy him a pony.
kw: Tom a vynn y pren y das hoba ragdho.

source: Do we have to do this tonight?
kw: Yw res dhyn gul hemma haneth?

source: You didn't need to do that.
kw: Nyns o res dhis gul henna.

source: You didn't have to do this.
kw: Nyns o res dhis gul hemma.

source: You didn't have to do that.
kw: Nyns o res dhis gul henna.

source: Do you have to do this now?
kw: Yw res dhis gul hemma lemmyn?

source: Do you have to do that now?
kw: Yw res dhis gul henna lemmyn?

source: You need to listen to me.
kw: Res yw dhis goslowes orthiv.

source: We need to eat something.
kw: Res yw dhyn dybri neppyth.

source: You don't have to leave.
kw: Nyns yw res dhis diberth.

source: Tom isn't Mary's father.
kw: Nyns yw Tom tas Maria.

source: Is that your girlfriend?
kw: Yw henna dha gares?

source: Did you have to do that?
kw: O res dhis gul henna?

source: What are those numbers?
kw: Pyth yw an niverow na?

source: Tom doesn't have a dog.
kw: Nyns eus ki dhe Tom.

source: Is that your boyfriend?
kw: Yw henna dha garer?

source: Do you have to do that?
kw: Yw res dhis gul henna?

source: We have to wear shoes.
kw: Res yw dhyn gwiska eskisyow.

source: You need to be there.
kw: Res yw dhis bos ena.

source: We could start again.
kw: Ni a allas dalleth arta.

source: My son's name is Tom.
kw: Tom yw hanow ow mab.

source: Isn't that Tom's dog?
kw: A nyns yw henna ki Tom?

source: Do you have to leave?
kw: Yw res dhis diberth?

source: Where are your kids?
kw: Ple’ma dha fleghes?

source: Do you have to stay?
kw: Yw res dhis gortos?

source: You need to listen.
kw: Res yw dhis goslowes.

source: Tom didn't see you.
kw: Ny’gas gwelas Tomm.

source: Those are my shoes.
kw: An re na yw ow eskisyow.

source: They're not hungry.
kw: Nyns eus dhedha nown.

source: You need to sleep.
kw: Res yw dhis koska.

source: You need to leave.
kw: Res yw dhis diberth.

source: Who was that girl?
kw: Piw o an vowes na?

source: This is our house.
kw: Hemm yw agan chi.

source: They need to talk.
kw: Res yw dhedha kewsel.

source: That was his name.
kw: Henn o y hanow.

source: I'll feed the dog.
kw: My a vydh maga an ki.

source: Do you need to go?
kw: Yw res dhis mos?

source: Do you have to go?
kw: Yw res dhis mos?

source: You need to help.
kw: Res yw dhis gweres.

source: You need to come.
kw: Res yw dhis dos.

source: We need to speak.
kw: Res yw dhyn kewsel.

source: You need to sit.
kw: Res yw dhis esedha.

source: We need to know.
kw: Res yw dhyn godhvos.

source: We had to leave.
kw: Res o dhyn diberth.

source: They are hungry.
kw: Yma nown dhedha.

source: Are you with us?
kw: Esos ta genen?

source: You need to go.
kw: Res yw dhis mos.

source: We need to eat.
kw: Res yw dhyn dybri.

source: We had to walk.
kw: Res o dhyn kerdhes.

source: We had to come.
kw: Res o dhyn dos.

source: Tom has a dog.
kw: Yma ki dhe Tom.

source: Was Tom busy?
kw: O Tom bysi?

source: Talk to me.
kw: Kows orthiv.

source: I want to see!
kw: My a vynn gweles!

source: You like apples.
kw: Da yw genes avalow.

source: I have to eat.
kw: Res yw dhymm dybri.

source: I have to drink.
kw: Res yw dhymm eva.

source: I read a book.
kw: My a red lyver.

source: Does Laurie have a computer?
kw: Eus dhe Laurie jynn-amontya?

source: I don't like to walk.
kw: Nyns yw da genev kerdhes.

source: She bought a toy for the boy.
kw: Hi a brenas gwariell rag an maw.

source: I go to school every morning.
kw: My a dhe’n skol pub myttin.

source: What colour is her hair?
kw: Py liw yw hy blew?

source: I must have a car.
kw: Res yw dhymm kavos karr.

source: I want those shoes!
kw: My a vynn an eskisyow na!

source: You must come here tomorrow.
kw: Res yw dhis dos omma a-vorow.

source: I want your blood.
kw: My a vynn kavos dha woos.

source: I have four brothers.
kw: Yma peswar broder dhymm.

source: You must come with me.
kw: Res yw dhis dos genev.

source: Is that your dog over there?
kw: Yw henna dha gi yn-hons?

source: I hate my family.
kw: Kas yw genev ow theylu.

source: I hated school.
kw: Kas o genev skol.

source: Tom walks his dog every morning.
kw: Tom a kerdh y gi pub myttin.

source: He has seven sons.
kw: Yma dhodho seyth mab.

source: The weather is bad.
kw: Drog yw an gewer.

source: I like to dance.
kw: Da yw genev donsya.

source: Tom is a little older than me.
kw: Tom yw nebes kottha agesov.

source: I can't come tomorrow.
kw: Ny allav vy dos a-vorow.

source: You could sell that.
kw: Ty a allas gwertha henna.

source: We could sell that.
kw: Ni a allas gwertha henna.

source: You're my friends.
kw: Ow hothmans owgh hwi.

source: We must hurry now.
kw: Res yw dhyn fistena lemmyn.

source: You must sell it.
kw: Res yw dhis y wertha.

source: It's snowing now.
kw: Yma hi ow kul ergh lemmyn.

source: It's raining now.
kw: Yma hi ow kul glaw lemmyn.

source: That's my dog.
kw: Ow gi yw henna.

source: It's warm.
kw: Tomm yw.

source: Do you like the colors?
kw: Yw da genes an liwyow?

source: Do you like cats?
kw: Yw da genowgh kathes?

source: The keys, please.
kw: An alhwedhow, mar pleg.

source: Do you like coffee?
kw: Yw da genes koffi?

source: I have a friend.
kw: Yma dhymm kothman.

source: Listen to me!
kw: Goslow orthiv!

source: That isn't a dog.
kw: Nyns yw henna ki.

source: Hi!
kw: Hou!

source: She didn't give me anything.
kw: Ny ros hi dhymm tra vyth.

source: I hate children.
kw: Kas yw genev fleghes.

source: I don't hate children!
kw: Nyns yw kas genev fleghes!

source: Did you like the bicycle?
kw: O da genes an dhiwros?

source: I want a dog.
kw: My a vynn kavos an ki.

source: Do you love my sister?
kw: A gerydh ow hwor?

source: That skirt is long.
kw: Hir yw an losten na.

source: Morning!
kw: Myttin da!

source: She wants to read a book.
kw: Hi a vynn redya lyver.

source: She's five.
kw: Pymp bloodh yw hi.

source: She will work.
kw: Hi a vynn oberi.

source: I must go home.
kw: Res yw dhymm mos tre.

source: Tom looked at his dog.
kw: Tom a viras orth y gi.

source: I have eight brothers.
kw: Yma eth broder dhymm.

source: I have a cow.
kw: Yma bugh dhymm.

source: Your horse is beautiful.
kw: Teg yw dha vargh.

source: Do you need bread, sausage and cheese?
kw: Eus edhom dhis a vara, a selsig hag a geus?

source: I want an apple.
kw: My a vynn kavos aval.

source: I want to eat the cheese.
kw: My a vynn dybri an keus.

source: Do you need to leave now?
kw: Yw res dhis diberth lemmyn?

source: She speaks seven languages.
kw: Hi a gews seyth yeth.

source: Raspberries are very expensive.
kw: Avan yw pur gostek.

source: I have a book.
kw: Yma lyver dhymm.

source: I was smoking.
kw: Yth esen vy ow megi.

source: I was playing.
kw: Yth esen vy ow kwari.

source: The house was big.
kw: Bras o an chi.

source: What colour is it?
kw: Py liw yw?

source: I hate fish.
kw: Kas yw genev pysk.

source: What color is it?
kw: Py liw yw?

source: Do you like chocolate?
kw: Yw da genes choklet?

source: I don't like to work.
kw: Nyns yw da genev oberi.

source: She doesn't like to work.
kw: Nyns yw da gensi oberi.

source: It's quarter past six.
kw: Kwarter wosa hwegh eur yw.

source: She likes animals.
kw: Da yw gensi enevales.

source: He shouted for help.
kw: Ev a armas rag gweres.

source: I like Tatoeba.
kw: Da yw genev Tatoeba.

source: He is late.
kw: Diwedhes yw.

source: She is late.
kw: Diwedhes yw.

source: Tom wants me to help Mary.
kw: Tom a vynn orthiv gweres Maria.

source: Tom can't come with us.
kw: Ny yll Tom dos genen.

source: What kind of dog is this?
kw: Py par ki yw hemma?

source: She can come.
kw: Hi a yll dos.

source: Has she got a dog?
kw: Eus ki dhedhi?

source: Has he got a dog?
kw: Eus ki dhodho?

source: Who found the book that I had lost?
kw: Piw a gavas an lyver a wrussen vy y gelli?

source: I'm singing.
kw: Yth esov vy ow kana.

source: She's Laurie.
kw: Laurie yw hi.

source: Mary wasn't there.
kw: Nyns esa Maria ena.

source: I like Mary.
kw: Da yw genev Mary.

source: She likes Mary.
kw: Da yw gensi Mary.

source: They like Mary.
kw: Da yw gansa Mary.

source: I don't want to.
kw: Ny vynnav vy.

source: Tom is holding it.
kw: Yma Tom orth y synsi.

source: He hates parties.
kw: Kas yw ganso kevewiow.

source: Tom hates parties.
kw: Kas yw gans Tom kevewiow.

source: She hates parties.
kw: Kas yw gensio kevewiow.

source: Mary hates parties.
kw: Kas yw gans Mary kevewiow.

source: We hate parties.
kw: Kas yw genen kevewiow.

source: They hate parties.
kw: Kas yw gansa kevewiow.

source: He likes snow.
kw: Da yw ganso ergh.

source: She likes snow.
kw: Da yw gensi ergh.

source: Mary likes snow.
kw: Da yw gans Mary ergh.

source: We like snow.
kw: Da yw genen ergh.

source: They like snow.
kw: Da yw gansa ergh.

source: You broke it.
kw: Ty a wrug y derri.

source: We met Mary.
kw: Ni a vetyas orth Maria.

source: She has a cold.
kw: Yma anwos warnedhi.

source: She likes her job.
kw: Da yw gensi hy ober.

source: They like their job.
kw: Da yw gansa aga oberen.

source: She likes beans.
kw: Da yw gensi fav.

source: They like beans.
kw: Da yw gansa fav.

source: Mary knows me.
kw: Maria a’m aswon.

source: He is wasting time.
kw: Yma va ow skollya termyn.

source: I like that dog.
kw: Da yw genev an ki na.

source: They have a son.
kw: Yma dhedha mab.

source: She likes girls.
kw: Da yw gensi mowesi.

source: They like girls.
kw: Da yw gansa mowesi.

source: Mary knows nothing.
kw: Ny wor Maria tra vyth.

source: Those are not fish.
kw: Nyns yw an re na puskes.

source: She had a headache.
kw: Yth esa drog penn dhedhi.

source: Do we have to go there?
kw: Yw res dhyn mos ena?

source: She folded a blanket.
kw: Hi a blegyas lenn.

source: Go.
kw: Ke.

source: We slept in a very small tent.
kw: Ni a wrug koska yn tylda pur byghan.

source: She wants to speak.
kw: Hi a vynn kewsel.

source: Where are you taking us?
kw: Dhe by le yth esos ta orth agan gorra?

source: We must start now.
kw: Res yw dhyn dalleth lemmyn.

source: Who are those men?
kw: Piw yw an dus na?

source: You have to drink water.
kw: Res yw dhis eva dowr.

source: They have to drink water.
kw: Res yw dhedha eva dowr.

source: They didn't like the film.
kw: Nyns o da gansa an fylm.

source: Those women are strong.
kw: An benenes na yw krev.

source: I am not your son.
kw: Nyns ov dha vab.

source: Tom lit the candle with a match.
kw: Tom a enowis an gantol gans tanbren.

source: She wanted to help her friends.
kw: Hi a vynnas gweres hy howethes.

source: We need to work together.
kw: Res yw dhyn oberi war-barth.

source: Why do you want to talk to me?
kw: Prag y fynn'ta kewsel orthiv?

source: He needs a taxi.
kw: Yma edhom dhodho a daksi.

source: She needs a taxi.
kw: Yma edhom dhedhi a daksi.

source: I read his book.
kw: My a red y lyver.

source: I like your dogs.
kw: Da yw genev dha geun.

source: There is someone in this room.
kw: Yma nebonan y’n stevel-ma.

source: My baby wants to talk.
kw: Ow babi a vynn kewsel.

source: I don't like snow.
kw: Nyns yw da genev ergh.

source: Tom doesn't like women.
kw: Nyns yw da gans Tom benenes.

source: Tom doesn't like those women.
kw: Nyns yw da gans Tom an benenes na.

source: Tom doesn't like that woman.
kw: Nyns yw da gans Tom an venyn na.

source: Do we have to do this now?
kw: Yw res dhyn gul hemma lemmyn?

source: We could do that.
kw: Ni a allas gul henna.

source: We could do this.
kw: Ni a allas gul hemma.

source: We could sing together.
kw: Ni a allas kana war-barth.

source: We have to do that.
kw: Res yw dhyn gul henna.

source: We must go back.
kw: Res yw dhyn mos arta.

source: We must go now.
kw: Res yw dhyn mos lemmyn.

source: We must remain here.
kw: Res yw dhyn gortos omma.

source: We need to do something.
kw: Res yw dhyn gul neppyth.

source: Why do you want to go home early?
kw: Prag y fynn'ta mos tre a-varr?

source: Why do you want to leave?
kw: Prag y fynn'ta diberth?

source: You could do that.
kw: Ty a allas gul henna.

source: You could do this.
kw: Ty a allas gul hemma.

source: You could go home.
kw: Ty a allas mos tre.

source: You have to go now.
kw: Res yw dhis mos lemmyn.

source: You must go back.
kw: Res yw dhis mos arta.

source: You must go now.
kw: Res yw dhis mos lemmyn.

source: You need to go back.
kw: Res yw dhis mos arta.

source: You need to go home.
kw: Res yw dhis mos tre.

source: You need to go now.
kw: Res yw dhis mos lemmyn.

source: He must come.
kw: Res yw dhodho dos.

source: I have received your letter.
kw: My re dhegemeras dha lyther.

source: Can I come to your party tonight?
kw: A allav vy mos dhe’th kevewy haneth?

source: Can Tom come, too?
kw: A yll Tom dos ynwedh?

source: But nobody can help me.
kw: Saw ny yll den vyth ow gweres.

source: Did you drink wine?
kw: Es’ta owth eva gwin?

source: I believe that Tom loves me.
kw: My a grys Tom dhe’m kara.

source: This isn't my dog.
kw: Nyns yw hemma ow hi.

source: I am rich.
kw: Rych ov.

source: Why do you want to come with me?
kw: Prag y fynn'ta dos genev?

source: It's not a dog.
kw: Nyns yw ki.

source: They didn't need to come.
kw: Nyns o res dhedha dos.

source: They aren't hungry.
kw: Nyns eus dhedha nown.

source: I own one dog and one cat.
kw: Yma dhymm unn ki hag unn gath.

source: I own one cat and one dog.
kw: Yma dhymm unn gath hag unn ki.

source: Good afternoon!
kw: Dohajydh da!

source: Yes, she does.
kw: Gwra.

source: Yes, he does.
kw: Gwra.

source: Yes, it does.
kw: Gwra.

source: Will the weather on Saturday be sunny?
kw: A vydh an gewer howlyek de’Sadorn?

source: They don't like cats.
kw: Ny garons kathes.

source: She is ill.
kw: Klav yw.

source: Tom has gone to bed.
kw: Tom res eth dhe’n gweli.

source: How's the weather in Boston?
kw: Fatel yw an gewer yn Boston?

source: Does it snow in Boston?
kw: A wra ergh yn Boston?

source: She sees your horse.
kw: Hi a wel dha vargh.

source: He sees your horse.
kw: Ev a wel dha vargh.

source: Is there a television set in your bedroom?
kw: Eus pellwolok y’th chambour?

source: Don't smoke in bed.
kw: Na wra megi y’n gweli!

source: What colour is his hair?
kw: Py liw yw y vlew?

source: Wait.
kw: Gorta.

source: We have to speak.
kw: Res yw dhyn kewsel.

source: Why are you doing this?
kw: Prag yth es’ta ow kul hemma?

source: I will see you tomorrow.
kw: My a vynn dha weles a-vorow.

source: She is Alan's wife.
kw: Gwreg Alan yw.

source: It was warm yesterday.
kw: Tomm o de.

source: They have to go to school.
kw: Res yw dhedha mos dhe’n skol.

source: Splendid!
kw: Splann!

source: This is a green apple.
kw: Hemm yw aval glas.

source: Why do you need to know?
kw: Prag yth yw res dhis godhvos?

source: Do you like this band?
kw: Yw da genes an bagas ma?

source: Do you like dogs?
kw: Yw da genes keun?

source: Do you like my hair?
kw: Yw da genes ow gols?

source: Do you like to party?
kw: Yw da genes kevewya?

source: Do you like my shoes?
kw: Yw da genes ow eskisyow?

source: He's reading.
kw: Yma ev ow redya.

source: She doesn't like this color.
kw: Nyns yw da gensi an liw ma.

source: I'm drinking milk.
kw: Yth esov owth eva leth.

source: I hate this school.
kw: Kas yw genev an skol ma.

source: We're doctors.
kw: Medhogyon on.

source: Give me those things.
kw: Ro dhymm an traow na.

source: You need to eat something.
kw: Res yw dhis dybri neppyth.

source: The girls work.
kw: An mowysi a ober.

source: Tom has a black dog.
kw: Yma ki du dhe Tom.

source: Tom doesn't like coffee.
kw: Nyns yw da gans Tom koffi.
